### 📦 Plan for `sbx/eu-west-1/ecr`
```hcl
[0;90m03:36:42.073[0m [0;37mSTDOUT[0m [0;36mterraform: [0mAcquiring state lock. This may take a few moments...
[0;90m03:36:44.687[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform used the selected providers to generate the following execution
[0;90m03:36:44.687[0m [0;37mSTDOUT[0m [0;36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m create[0m[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # aws_ecr_lifecycle_policy.default_policy["microservice-a"][0m will be created[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "default_policy" {[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id          = (known after apply)[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m policy      = jsonencode([0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              [32m+[0m[0m rules = [[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  [32m+[0m[0m {[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m action       = {[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m type = "expire"[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m description  = "Remove untagged images after 3 days."[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m rulePriority = 1[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m selection    = {[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countNumber = 3[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countType   = "sinceImagePushed"[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countUnit   = "days"[0m
[0;90m03:36:44.688[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m tagStatus   = "untagged"[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  [32m+[0m[0m {[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m action       = {[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m type = "expire"[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m description  = "Remove images created by pull-requests older than 7 days."[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m rulePriority = 2[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m selection    = {[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countNumber    = 7[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countType      = "imageCountMoreThan"[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m tagPatternList = [[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                              [32m+[0m[0m "*pull_request*",[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                            ]
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m tagStatus      = "tagged"[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  [32m+[0m[0m {[0m
[0;90m03:36:44.689[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m action       = {[0m
[0;90m03:36:44.690[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m type = "expire"[0m
[0;90m03:36:44.690[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.690[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m description  = "Expire images older than 50 days."[0m
[0;90m03:36:44.690[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m rulePriority = 3[0m
[0;90m03:36:44.690[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m selection    = {[0m
[0;90m03:36:44.690[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countNumber = 50[0m
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countType   = "imageCountMoreThan"[0m
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m tagStatus   = "any"[0m
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m registry_id = (known after apply)[0m
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m repository  = "microservice-a"[0m
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # aws_ecr_lifecycle_policy.default_policy["microservice-b"][0m will be created[0m
[0;90m03:36:44.693[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "default_policy" {[0m
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id          = (known after apply)[0m
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m policy      = jsonencode([0m
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              [32m+[0m[0m rules = [[0m
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  [32m+[0m[0m {[0m
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m action       = {[0m
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m type = "expire"[0m
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m description  = "Remove untagged images after 3 days."[0m
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m rulePriority = 1[0m
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m selection    = {[0m
[0;90m03:36:44.694[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countNumber = 3[0m
[0;90m03:36:44.695[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countType   = "sinceImagePushed"[0m
[0;90m03:36:44.695[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countUnit   = "days"[0m
[0;90m03:36:44.695[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m tagStatus   = "untagged"[0m
[0;90m03:36:44.695[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.695[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:36:44.695[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  [32m+[0m[0m {[0m
[0;90m03:36:44.695[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m action       = {[0m
[0;90m03:36:44.695[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m type = "expire"[0m
[0;90m03:36:44.696[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.696[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m description  = "Remove images created by pull-requests older than 7 days."[0m
[0;90m03:36:44.696[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m rulePriority = 2[0m
[0;90m03:36:44.696[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m selection    = {[0m
[0;90m03:36:44.696[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countNumber    = 7[0m
[0;90m03:36:44.696[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countType      = "imageCountMoreThan"[0m
[0;90m03:36:44.697[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m tagPatternList = [[0m
[0;90m03:36:44.697[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                              [32m+[0m[0m "*pull_request*",[0m
[0;90m03:36:44.697[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                            ]
[0;90m03:36:44.697[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m tagStatus      = "tagged"[0m
[0;90m03:36:44.697[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.697[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:36:44.697[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  [32m+[0m[0m {[0m
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m action       = {[0m
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m type = "expire"[0m
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m description  = "Expire images older than 50 days."[0m
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m rulePriority = 3[0m
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m selection    = {[0m
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countNumber = 50[0m
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m countType   = "imageCountMoreThan"[0m
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m tagStatus   = "any"[0m
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m03:36:44.698[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m registry_id = (known after apply)[0m
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m repository  = "microservice-b"[0m
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # aws_ecr_repository.ecr_repository["microservice-a"][0m will be created[0m
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_ecr_repository" "ecr_repository" {[0m
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                  = (known after apply)[0m
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                   = (known after apply)[0m
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m image_tag_mutability = "MUTABLE"[0m
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name                 = "microservice-a"[0m
[0;90m03:36:44.699[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m registry_id          = (known after apply)[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m repository_url       = (known after apply)[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                 = {[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all             = {[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m image_scanning_configuration {[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m scan_on_push = true[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # aws_ecr_repository.ecr_repository["microservice-b"][0m will be created[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_ecr_repository" "ecr_repository" {[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                  = (known after apply)[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                   = (known after apply)[0m
[0;90m03:36:44.700[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m image_tag_mutability = "MUTABLE"[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name                 = "microservice-b"[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m registry_id          = (known after apply)[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m repository_url       = (known after apply)[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                 = {[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all             = {[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m image_scanning_configuration {[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m scan_on_push = true[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m[0m repositories_arns = {[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m microservice-a = (known after apply)[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m microservice-b = (known after apply)[0m
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:36:44.701[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m[0m repositories_urls = {[0m
[0;90m03:36:44.702[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m microservice-a = (known after apply)[0m
[0;90m03:36:44.702[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m microservice-b = (known after apply)[0m
[0;90m03:36:44.702[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
```
